TianGan = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸']
DiZhi = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥']
JQMC = ["冬至", "小寒", "大寒", "立春", "雨水", "惊蛰", "春分", "清明", "谷雨", "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑", "白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪"]
WuXingShengL = ['木', '火', '土', '金', '水']
WuXingKeL = ['金', '木', '土', '水', '火']


WuXingSheng = {}
for i in range(len(WuXingShengL)):
    WuXingSheng[WuXingShengL[i]] = WuXingShengL[(i+1)%len(WuXingShengL)]

WuXingKe = {}
for i in range(len(WuXingKeL)):
    WuXingKe[WuXingKeL[i]] = WuXingKeL[(i+1)%len(WuXingKeL)]

WuXingTianGan = {}
for i in range(len(TianGan)):
    WuXingTianGan[TianGan[i]] = [WuXingShengL[i//2], 1 - i % 2]

# WuXingTianGan = {
#     '甲': ['木', 1],
#     '乙': ['木', 0],
#     '丙': ['火', 1],
#     '丁': ['火', 0],
#     '戊': ['土', 1],
#     '己': ['土', 0],
#     '庚': ['金', 1],
#     '辛': ['金', 0],
#     '壬': ['水', 1],
#     '癸': ['水', 0],
# }
WuXingDiZhi = {
    '寅': ['木', 1],
    '卯': ['木', 0],
    '辰': ['土', 1],
    '巳': ['火', 0],
    '午': ['火', 1],
    '未': ['土', 0],
    '申': ['金', 1],
    '酉': ['金', 0],
    '戌': ['土', 1],
    '亥': ['水', 0],
    '子': ['水', 1],
    '丑': ['土', 0],
}

TianGanWuHe = {
    ('甲', '己'): '合⋅化土',
    ('乙', '庚'): '合⋅化金',
    ('丙', '辛'): '合⋅化水',
    ('丁', '壬'): '合⋅化木',
    ('戊', '癸'): '合⋅化火',
}

TianGanSiChong = {
    ('甲', '庚'): None,
    ('乙', '辛'): None,
    ('丙', '壬'): None,
    ('丁', '癸'): None,
}

DiZhiLiuHe = {
    ('子', '丑'): '合⋅化土',
    ('寅', '亥'): '合⋅化木',
    ('卯', '戌'): '合⋅化火',
    ('辰', '酉'): '合⋅化金',
    ('巳', '申'): '合⋅化水',
    ('午', '未'): '',
}
DiZhiLiuChong = {
    ('子', '午'): None,
    ('丑', '未'): None,
    ('寅', '申'): None,
    ('卯', '酉'): None,
    ('辰', '戌'): None,
    ('巳', '亥'): None,
}
DiZhiLiuHai = {
    ('戌', '酉'): None,
    ('亥', '申'): None,
    ('子', '未'): None,
    ('丑', '午'): None,
    ('寅', '巳'): None,
    ('卯', '辰'): None,
}
DiZhiSiXing = {
    #  无礼
    ('子', '卯'): None,
    ('卯', '卯'): None,
    # 恃势
    ('寅', '巳'): None,
    ('巳', '申'): None,
    ('申', '寅'): None,
    # 无恩
    ('丑', '戌'): None,
    ('戌', '未'): None,
    ('未', '丑'): None,
    # 自刑
    ('辰', '辰'): None,
    ('午', '午'): None,
    ('酉', '酉'): None,
    ('亥', '亥'): None,
}

DiZhiSiHuiFang = {
    ('寅', '卯', '辰'): '会⋅东方一气⋅木',
    ('巳', '午', '未'): '会⋅南方一气⋅火',
    ('申', '酉', '戌'): '会⋅西方一气⋅金',
    ('亥', '子', '丑'): '会⋅北方一气⋅水',
}
DiZhiWuHuiJu = {
    ('亥', '卯', '未'): '合木',
    ('寅', '午', '戌'): '合火',
    ('巳', '酉', '丑'): '合金',
    ('申', '子', '辰'): '合水',
    ('辰', '戌', '丑', '未'): '合土',
}
DiZhiBanHuiJu = {
    ('亥', '卯'): '半合木',
    ('卯', '未'): '半合木',
    ('寅', '午'): '半合火',
    ('午', '戌'): '半合火',
    ('巳', '酉'): '半合金',
    ('酉', '丑'): '半合金',
    ('申', '子'): '半合水',
    ('子', '辰'): '半合水',
}

DiZhiSiJi = {
    '春': ('寅', '卯', '辰'),
    '夏': ('巳', '午', '未'),
    '秋': ('申', '酉', '戌'),
    '冬': ('亥', '子', '丑'),
}
DiZhiCangGan = {
    '子': ('癸',),
    '丑': ('己', '癸', '辛'),
    '寅': ('甲', '丙', '戊'),
    '卯': ('乙',),
    '辰': ('戊', '乙', '癸'),
    '巳': ('丙', '庚', '戊'),
    '午': ('丁', '己'),
    '未': ('己', '丁', '乙'),
    '申': ('庚', '壬', '戊'),
    '酉': ('辛',),
    '戌': ('戊', '辛', '丁'),
    '亥': ('壬', '甲')

}

WuXingSiShi = {
    '木': {'旺': '春', '相': '冬', '休': '夏', '囚': '季', '死': '秋'},
    '火': {'旺': '夏', '相': '春', '休': '季', '囚': '秋', '死': '冬'},
    '土': {'旺': '季', '相': '夏', '休': '秋', '囚': '冬', '死': '春'},
    '金': {'旺': '秋', '相': '季', '休': '冬', '囚': '春', '死': '夏'},
    '水': {'旺': '冬', '相': '秋', '休': '春', '囚': '夏', '死': '季'},
}

ShiErChangSheng = {
    '甲': {'长生': '亥', '沐浴': '子', '冠带': '丑', '临官': '寅', '帝旺': '卯', '衰': '辰', '病': '巳', '死': '午', '墓': '未', '绝': '申', '胎': '酉', '养': '戌'},
    '乙': {'长生': '午', '沐浴': '巳', '冠带': '辰', '临官': '卯', '帝旺': '寅', '衰': '丑', '病': '子', '死': '亥', '墓': '戌', '绝': '酉', '胎': '申', '养': '未'},
    '丙': {'长生': '寅', '沐浴': '卯', '冠带': '辰', '临官': '巳', '帝旺': '午', '衰': '未', '病': '申', '死': '酉', '墓': '戌', '绝': '亥', '胎': '子', '养': '丑'},
    '丁': {'长生': '酉', '沐浴': '申', '冠带': '未', '临官': '午', '帝旺': '巳', '衰': '辰', '病': '卯', '死': '寅', '墓': '丑', '绝': '子', '胎': '亥', '养': '戌'},
    '戊': {'长生': '寅', '沐浴': '卯', '冠带': '辰', '临官': '巳', '帝旺': '午', '衰': '未', '病': '申', '死': '酉', '墓': '戌', '绝': '亥', '胎': '子', '养': '丑'},
    '己': {'长生': '酉', '沐浴': '申', '冠带': '未', '临官': '午', '帝旺': '巳', '衰': '辰', '病': '卯', '死': '寅', '墓': '丑', '绝': '子', '胎': '亥', '养': '戌'},
    '庚': {'长生': '巳', '沐浴': '午', '冠带': '未', '临官': '申', '帝旺': '酉', '衰': '戌', '病': '亥', '死': '子', '墓': '丑', '绝': '寅', '胎': '卯', '养': '辰'},
    '辛': {'长生': '子', '沐浴': '亥', '冠带': '戌', '临官': '酉', '帝旺': '申', '衰': '未', '病': '午', '死': '巳', '墓': '辰', '绝': '卯', '胎': '寅', '养': '丑'},
    '壬': {'长生': '申', '沐浴': '酉', '冠带': '戌', '临官': '亥', '帝旺': '子', '衰': '丑', '病': '寅', '死': '卯', '墓': '辰', '绝': '巳', '胎': '午', '养': '未'},
    '癸': {'长生': '卯', '沐浴': '寅', '冠带': '丑', '临官': '子', '帝旺': '亥', '衰': '戌', '病': '酉', '死': '申', '墓': '未', '绝': '午', '胎': '巳', '养': '辰'},
}